Alex Rehnby-Martin
V00806516

* Task 1
#+BEGIN_SRC sql
with stats as
  (select episodeof, count(distinct season) as cseasons, avg(votes) as avotes, avg(rank) as arank, count(*) as cepisodes from episodes natural join ratings group by episodeof),
shows as
  (select * from stats where cseasons >= 4 and arank > 8.5 and avotes >= 1000)
select episodeof, arank, avotes, cepisodes, cseasons from shows order by arank desc, avotes desc;
#+END_SRC

#+RESULTS:
| episodeof                     |            arank |                avotes | cepisodes | cseasons |
|-------------------------------+------------------+-----------------------+-----------+----------|
| "Person of Interest" (2011)   | 9.13980582524272 | 2047.6310679611650485 |       103 |        5 |
| "Breaking Bad" (2008)         | 9.01935483870968 |    11124.709677419355 |        62 |        5 |
| "Game of Thrones" (2011)      | 8.99833333333333 |    19718.333333333333 |        60 |        6 |
| "Sherlock" (2010)             | 8.94166666666666 |    15931.333333333333 |        12 |        4 |
| "Suits" (2011)                | 8.85357142857143 | 1318.0000000000000000 |        84 |        6 |
| "The Wire" (2002)             | 8.84333333333333 | 1422.1166666666666667 |        60 |        5 |
| "House of Cards" (2013)       | 8.72884615384615 | 2628.5000000000000000 |        52 |        4 |
| "Supernatural" (2005)         | 8.71611570247935 | 2059.5123966942148760 |       242 |       11 |
| "House M.D." (2004)           | 8.69318181818181 | 1439.4602272727272727 |       176 |        8 |
| "Sons of Anarchy" (2008)      | 8.69239130434783 | 1145.6195652173913043 |        92 |        7 |
| "Prison Break" (2005)         | 8.68395061728395 | 1629.8518518518518519 |        81 |        4 |
| "Lost" (2004)                 | 8.67692307692307 | 2819.5811965811965812 |       117 |        6 |
| "The Sopranos" (1999)         | 8.67209302325582 | 1574.4186046511627907 |        86 |        6 |
| "Dexter" (2006)               | 8.64166666666666 | 2802.8750000000000000 |        96 |        8 |
| "Luther" (2010)               | 8.59411764705882 | 1103.4705882352941176 |        17 |        4 |
| "Boardwalk Empire" (2010)     | 8.55087719298246 | 1095.0877192982456140 |        57 |        5 |
| "Friends" (1994)              | 8.54152542372881 | 1642.8898305084745763 |       236 |       10 |
| "Vikings" (2013)              | 8.53589743589744 | 1740.2051282051282051 |        39 |        4 |
| "Mad Men" (2007)              | 8.53152173913044 | 1100.8804347826086957 |        92 |        7 |
| "Arrow" (2012)                | 8.52717391304348 | 3053.7934782608695652 |        92 |        4 |
| "Once Upon a Time" (2011)     |  8.5212389380531 | 1000.0530973451327434 |       113 |        5 |
| "Arrested Development" (2003) | 8.51470588235294 | 1062.6176470588235294 |        68 |        4 |

#+ratings:
| Table "public.ratings"                 |                        |           |
|----------------------------------------+------------------------+-----------|
| Column                                 | Type                   | Modifiers |
| id                                     | character varying(400) | not null  |
| dist                                   | character(10)          |           |
| votes                                  | integer                |           |
| rank                                   | double precision       |           |
| Indexes:                               |                        |           |
| "ratings_pkey" PRIMARY KEY, btree (id) |                        |           |

#+episodes:
| Table "public.episodes"                                                                        |                        |           |
|------------------------------------------------------------------------------------------------+------------------------+-----------|
| Column                                                                                         | Type                   | Modifiers |
| id                                                                                             | character varying(400) | not null  |
| subtitle                                                                                       | character varying(400) |           |
| season                                                                                         | integer                |           |
| epnumber                                                                                       | integer                |           |
| episodeof                                                                                      | character varying(400) |           |
| Indexes:                                                                                       |                        |           |
| "episodes_pkey" PRIMARY KEY, btree (id)                                                        |                        |           |
| Foreign-key constraints:                                                                       |                        |           |
| "episodes_episodeof_fkey" FOREIGN KEY (episodeof) REFERENCES productions(id) ON DELETE CASCADE |                        |           |
| "episodes_id_fkey" FOREIGN KEY (id) REFERENCES productions(id) ON DELETE CASCADE               |                        |           |
* Task 2 
#+BEGIN_SRC sql
with movies as
  (select * from productions natural join ratings where attr is NULL and votes > 50000),
mmax as 
  (select max(rank) from movies)
select title, year, rank, votes from movies where rank = (select * from mmax);
#+END_SRC

#+RESULTS:
| title                    | year | rank |   votes |
|--------------------------+------+------+---------|
| The Shawshank Redemption | 1994 |  9.3 | 1698604 |
* Task 3 
#+BEGIN_SRC sql
with movies as
  (select * from productions natural join ratings where attr is NULL and rank >= 8 and votes >= 50000),
people as
  (select pid, count(*) as count, avg(rank) from movies natural join roles group by pid )
select * from people where count >= 10 order by avg;
#+END_SRC

#+RESULTS:
| pid                    | count |              avg |
|------------------------+-------+------------------|
| Tovey, Arthur          |    11 | 8.21818181818182 |
| McGowan, Mickie        |    10 |             8.23 |
| Flowers, Bess          |    12 | 8.25833333333333 |
| Lynn, Sherry (I)       |    12 | 8.25833333333333 |
| Ratzenberger, John (I) |    12 | 8.28333333333333 |
| Oliveira, Joseph (III) |    10 |             8.38 |
* Task 4 

#+BEGIN_SRC sql
with movies as
  (select * from productions natural join ratings where attr is NULL and rank > 8 and votes >= 50000),
highroles as
  (select * from movies natural join roles),
people as
  (select pid, count(*) as count from highroles group by pid),
actor as 
  (select * from people where count = (select max(count) from people))
select * from actor natural join highroles;
#+END_SRC

#+RESULTS:
| pid                    | count | id                                                    | title                                          | year | index | notes | attr |       dist |  votes | rank | character                | billing | snote                   |
|------------------------+-------+-------------------------------------------------------+------------------------------------------------+------+-------+-------+------+------------+--------+------+--------------------------+---------+-------------------------|
| Ratzenberger, John (I) |    10 | Toy Story (1995)                                      | Toy Story                                      | 1995 |       |       |      | 0000001322 | 627542 |  8.3 | Hamm                     |       6 | ;voice                  |
| Ratzenberger, John (I) |    10 | Toy Story 3 (2010)                                    | Toy Story 3                                    | 2010 |       |       |      | 0000001222 | 548134 |  8.3 | Hamm                     |       8 | ;voice                  |
| Ratzenberger, John (I) |    10 | Up (2009)                                             | Up                                             | 2009 |       |       |      | 0000001222 | 669980 |  8.3 | Construction Foreman Tom |       7 | ;voice                  |
| Ratzenberger, John (I) |    10 | WALL·E (2008)                                         | WALL·E                                         | 2008 |       |       |      | 0000001222 | 723236 |  8.4 | John                     |       6 | ;voice                  |
| Ratzenberger, John (I) |    10 | Finding Nemo (2003)                                   | Finding Nemo                                   | 2003 |       |       |      | 0000001321 | 697085 |  8.2 | Fish School              |      24 | ;voice                  |
| Ratzenberger, John (I) |    10 | Gandhi (1982)                                         | Gandhi                                         | 1982 |       |       |      | 0000001321 | 172573 |  8.1 | American Lieutenant      |     124 |                         |
| Ratzenberger, John (I) |    10 | Inside Out (2015/I)                                   | Inside Out                                     | 2015 | I     |       |      | 0000001222 | 351463 |  8.3 | Fritz                    |      17 | ;voice                  |
| Ratzenberger, John (I) |    10 | Monsters, Inc. (2001)                                 | Monsters, Inc.                                 | 2001 |       |       |      | 0000001321 | 589404 |  8.1 | The Abominable Snowman   |       8 | ;voice                  |
| Ratzenberger, John (I) |    10 | Sen to Chihiro no kamikakushi (2001)                  | Sen to Chihiro no kamikakushi                  | 2001 |       |       |      | 0000000223 | 420957 |  8.6 | Assistant Manager        |      56 | ;voice: English version |
| Ratzenberger, John (I) |    10 | Star Wars: Episode V - The Empire Strikes Back (1980) | Star Wars: Episode V - The Empire Strikes Back | 1980 |       |       |      | 0000000223 | 842625 |  8.8 | Rebel Force Major Derlin |      31 |                         |
* Task 5 

#+BEGIN_SRC sql
with movies as
  (select * from productions natural join ratings natural join directors where attr is NULL and votes >= 40000),
goodmovies as
  (select * from movies where rank > 8.4),
dircount as
  (select pid, count(*) as total from movies group by pid),
gooddirs as
  (select * from dircount where total > 8 and pid in (select pid from goodmovies)),
gooddircount as 
  (select pid, count(*) as goodcount from goodmovies group by pid),
goodstats as
  (select pid, avg(rank) as avggoodones from goodmovies group by pid),
badstats as
  (select pid, avg(rank) as avgrest from movies where rank <= 8.4 group by pid)
select pid, total, goodcount*100.0/total as prop, goodcount as goodones, avggoodones, total-goodcount as rest, avgrest, avggoodones-avgrest as diff from gooddircount natural join gooddirs natural join goodstats natural join badstats;
#+END_SRC

#+RESULTS:
| pid                    | total |                prop | goodones |      avggoodones | rest |          avgrest |              diff |
|------------------------+-------+---------------------+----------+------------------+------+------------------+-------------------|
| Fincher, David         |    10 | 20.0000000000000000 |        2 |              8.7 |    8 |           7.5125 |            1.1875 |
| Kubrick, Stanley       |    11 | 18.1818181818181818 |        2 |              8.5 |    9 | 8.04444444444444 | 0.455555555555556 |
| Nolan, Christopher (I) |     9 | 66.6666666666666667 |        6 |             8.65 |    3 |              7.7 |              0.95 |
| Coppola, Francis Ford  |     9 | 33.3333333333333333 |        3 |              8.9 |    6 | 7.16666666666667 |  1.73333333333333 |
| Scorsese, Martin (I)   |    15 | 13.3333333333333333 |        2 |              8.6 |   13 | 7.68461538461538 | 0.915384615384616 |
| Tarantino, Quentin     |    12 | 16.6666666666666667 |        2 |              8.7 |   10 |             7.77 | 0.930000000000001 |
| Scott, Ridley          |    18 | 11.1111111111111111 |        2 |              8.5 |   16 |          6.99375 |           1.50625 |
| Miyazaki, Hayao        |    10 | 10.0000000000000000 |        1 |              8.6 |    9 | 8.02222222222222 | 0.577777777777779 |
| Zemeckis, Robert       |    15 | 13.3333333333333333 |        2 |             8.65 |   13 |              7.1 |              1.55 |
| Jackson, Peter (I)     |    11 | 27.2727272727272727 |        3 |              8.8 |    8 |           7.4125 |            1.3875 |
| Spielberg, Steven      |    25 | 12.0000000000000000 |        3 | 8.66666666666667 |   22 | 7.43636363636364 |  1.23030303030303 |
| Hitchcock, Alfred (I)  |    14 | 14.2857142857142857 |        2 |              8.5 |   12 | 7.98333333333333 | 0.516666666666667 |

#+BEGIN_SRC sql
\d directors
#+END_SRC

#+RESULTS:
| Table "public.directors"                                                          |                        |           |
|-----------------------------------------------------------------------------------+------------------------+-----------|
| Column                                                                            | Type                   | Modifiers |
| id                                                                                | character varying(400) | not null  |
| pid                                                                               | character varying(200) | not null  |
| dnote                                                                             | character varying(500) | not null  |
| Indexes:                                                                          |                        |           |
| "directors_pkey" PRIMARY KEY, btree (id, pid, dnote)                              |                        |           |
| Foreign-key constraints:                                                          |                        |           |
| "directors_id_fkey" FOREIGN KEY (id) REFERENCES productions(id) ON DELETE CASCADE |                        |           |
| "directors_pid_fkey" FOREIGN KEY (pid) REFERENCES persons(pid) ON DELETE CASCADE  |                        |           |

